[MecRuler_Rifle X2WeaponTemplate]
FriendlyName="变种人SPARK 统御炮"
FriendlyNamePlural="变种人SPARK 统御炮"

[TRAdvSpark_Rifle X2WeaponTemplate]
FriendlyName="变种人SPARK加农炮"
FriendlyNamePlural="变种人SPARK加农炮"

[MecRulerMicroMissiles X2AbilityTemplate]
LocFriendlyName="微型导弹"
LocLongDescription="MEC的肩部装载的导弹发射器可以连续发射一排球形导弹，造成高额伤害，并将敌人击退并使其混乱。"
LocHelpText="对一片区域进行爆炸性导弹攻击。"

[TRAdvSparkMicroMissiles X2AbilityTemplate]
LocFriendlyName="微型导弹"
LocLongDescription="MEC的肩部装载的导弹发射器可以连续发射一排球形导弹，造成高额伤害，并将敌人击退并使其混乱。"
LocHelpText="对一片区域进行爆炸性导弹攻击。"

[MecRulerArmorRepairModule X2AbilityTemplate]
LocFriendlyName="护甲修复模块"
LocLongDescription="获得自动修复破损护甲的能力。"
LocHelpText="获得自动修复破损护甲的能力。"

[MecRulerBSDamageReductionModule X2AbilityTemplate]
LocFriendlyName="增强防火墙模块"
LocLongDescription="减少因类似蓝屏效果所受的伤害。"
LocHelpText="减少因类似蓝屏效果所受的伤害。"

[MecRulerMeleeResistanceModule X2AbilityTemplate]
LocFriendlyName="预测近战模块"
LocLongDescription="减少来自近战攻击的伤害。"
LocHelpText="减少来自近战攻击的伤害。"

[MecRulerStrike X2AbilityTemplate]
LocFriendlyName="裁决者打击"
LocLongDescription="使用强力近战攻击攻击移动范围内的任何敌人。"
LocHelpText="使用强力近战攻击攻击移动范围内的任何敌人。"

[CTDRoundsShieldBurst X2AbilityTemplate]
LocFriendlyName="护盾涌动"
LocLongDescription="触发单位的护盾涌动，造成额外伤害。"
LocHelpText="触发单位的护盾涌动，造成额外伤害。"

[MecRulerRootProtocolShot X2AbilityTemplate]
LocFriendlyName="裁决者束缚协议"
LocFlyOverText="已束缚"
LocLongDescription="束缚单位在其当前位置，使其无法移动。"
LocHelpText="束缚单位在其当前位置，使其无法移动。"

[MecRulerArmor_XCOM_TorsoPart X2BodyPartTemplate]
DisplayName="变种人SPARK底盘"

[CTDRounds X2AmmoTemplate]
FriendlyName="CTD弹药"
FriendlyNamePlural="CTD弹药"
BriefSummary="猜对了CTD的含义也没有奖励；这些弹药对机器人单位造成严重破坏。虽然效果不如我们自己的蓝屏弹药，但它对拥有护盾生命值的单位造成额外伤害。"
TacticalText="<Bullet/> 这些弹药包含具有破坏性的EMP微爆炸技术，使其对抗机器人对手时非常有效。<br>"
